MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2685/mcu.h
// Generated 05/01/2024 GMT

/*
 * Copyright © 2024, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18LF2685_H_
#define _PIC18LF2685_H_

/*
 * C Header file for the Microchip PIC Microcontroller
 * PIC18LF2685
 */
#ifndef _XC_H_
#warning Header file pic18lf2685.h included directly. Use #include <xc.h> instead.
#endif

#include <__at.h>

/*
 * Register Definitions
 */

// Register: RXF6SIDH
#define RXF6SIDH RXF6SIDH
extern volatile unsigned char           RXF6SIDH            __at(0xD60);
#ifndef _LIB_BUILD
asm("RXF6SIDH equ 0D60h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF6SID3               :1;
        unsigned RXF6SID4               :1;
        unsigned RXF6SID5               :1;
        unsigned RXF6SID6               :1;
        unsigned RXF6SID7               :1;
        unsigned RXF6SID8               :1;
        unsigned RXF6SID9               :1;
        unsigned RXF6SID10              :1;
    };
} RXF6SIDHbits_t;
extern volatile RXF6SIDHbits_t RXF6SIDHbits __at(0xD60);
// bitfield macros
#define _RXF6SIDH_SID3_POSN                                 0x0
#define _RXF6SIDH_SID3_POSITION                             0x0
#define _RXF6SIDH_SID3_SIZE                                 0x1
#define _RXF6SIDH_SID3_LENGTH                               0x1
#define _RXF6SIDH_SID3_MASK                                 0x1
#define _RXF6SIDH_SID4_POSN                                 0x1
#define _RXF6SIDH_SID4_POSITION                             0x1
#define _RXF6SIDH_SID4_SIZE                                 0x1
#define _RXF6SIDH_SID4_LENGTH                               0x1
#define _RXF6SIDH_SID4_MASK                                 0x2
#define _RXF6SIDH_SID5_POSN                                 0x2
#define _RXF6SIDH_SID5_POSITION                             0x2
#define _RXF6SIDH_SID5_SIZE                                 0x1
#define _RXF6SIDH_SID5_LENGTH                               0x1
#define _RXF6SIDH_SID5_MASK                                 0x4
#define _RXF6SIDH_SID6_POSN                                 0x3
#define _RXF6SIDH_SID6_POSITION                             0x3
#define _RXF6SIDH_SID6_SIZE                                 0x1
#define _RXF6SIDH_SID6_LENGTH                               0x1
#define _RXF6SIDH_SID6_MASK                                 0x8
#define _RXF6SIDH_SID7_POSN                                 0x4
#define _RXF6SIDH_SID7_POSITION                             0x4
#define _RXF6SIDH_SID7_SIZE                                 0x1
#define _RXF6SIDH_SID7_LENGTH                               0x1
#define _RXF6SIDH_SID7_MASK                                 0x10
#define _RXF6SIDH_SID8_POSN                                 0x5
#define _RXF6SIDH_SID8_POSITION                             0x5
#define _RXF6SIDH_SID8_SIZE                                 0x1
#define _RXF6SIDH_SID8_LENGTH                               0x1
#define _RXF6SIDH_SID8_MASK                                 0x20
#define _RXF6SIDH_SID9_POSN                                 0x6
#define _RXF6SIDH_SID9_POSITION                             0x6
#define _RXF6SIDH_SID9_SIZE                                 0x1
#define _RXF6SIDH_SID9_LENGTH                               0x1
#define _RXF6SIDH_SID9_MASK                                 0x40
#define _RXF6SIDH_SID10_POSN                                0x7
#define _RXF6SIDH_SID10_POSITION                            0x7
#define _RXF6SIDH_SID10_SIZE                                0x1
#define _RXF6SIDH_SID10_LENGTH                              0x1
#define _RXF6SIDH_SID10_MASK                                0x80
#define _RXF6SIDH_RXF6SID3_POSN                             0x0
#define _RXF6SIDH_RXF6SID3_POSITION                         0x0
#define _RXF6SIDH_RXF6SID3_SIZE                             0x1
#define _RXF6SIDH_RXF6SID3_LENGTH                           0x1
#define _RXF6SIDH_RXF6SID3_MASK                             0x1
#define _RXF6SIDH_RXF6SID4_POSN                             0x1
#define _RXF6SIDH_RXF6SID4_POSITION                         0x1
#define _RXF6SIDH_RXF6SID4_SIZE                             0x1
#define _RXF6SIDH_RXF6SID4_LENGTH                           0x1
#define _RXF6SIDH_RXF6SID4_MASK                             0x2
#define _RXF6SIDH_RXF6SID5_POSN                             0x2
#define _RXF6SIDH_RXF6SID5_POSITION                         0x2
#define _RXF6SIDH_RXF6SID5_SIZE                             0x1
#define _RXF6SIDH_RXF6SID5_LENGTH                           0x1
#define _RXF6SIDH_RXF6SID5_MASK                             0x4
#define _RXF6SIDH_RXF6SID6_POSN                             0x3
#define _RXF6SIDH_RXF6SID6_POSITION                         0x3
#define _RXF6SIDH_RXF6SID6_SIZE                             0x1
#define _RXF6SIDH_RXF6SID6_LENGTH                           0x1
#define _RXF6SIDH_RXF6SID6_MASK                             0x8
#define _RXF6SIDH_RXF6SID7_POSN                             0x4
#define _RXF6SIDH_RXF6SID7_POSITION                         0x4
#define _RXF6SIDH_RXF6SID7_SIZE                             0x1
#define _RXF6SIDH_RXF6SID7_LENGTH                           0x1
#define _RXF6SIDH_RXF6SID7_MASK                             0x10
#define _RXF6SIDH_RXF6SID8_POSN                             0x5
#define _RXF6SIDH_RXF6SID8_POSITION                         0x5
#define _RXF6SIDH_RXF6SID8_SIZE                             0x1
#define _RXF6SIDH_RXF6SID8_LENGTH                           0x1
#define _RXF6SIDH_RXF6SID8_MASK                             0x20
#define _RXF6SIDH_RXF6SID9_POSN                             0x6
#define _RXF6SIDH_RXF6SID9_POSITION                         0x6
#define _RXF6SIDH_RXF6SID9_SIZE                             0x1
#define _RXF6SIDH_RXF6SID9_LENGTH                           0x1
#define _RXF6SIDH_RXF6SID9_MASK                             0x40
#define _RXF6SIDH_RXF6SID10_POSN                            0x7
#define _RXF6SIDH_RXF6SID10_POSITION                        0x7
#define _RXF6SIDH_RXF6SID10_SIZE                            0x1
#define _RXF6SIDH_RXF6SID10_LENGTH                          0x1
#define _RXF6SIDH_RXF6SID10_MASK                            0x80

// Register: RXF6SIDL
#define RXF6SIDL RXF6SIDL
extern volatile unsigned char           RXF6SIDL            __at(0xD61);
#ifndef _LIB_BUILD
asm("RXF6SIDL equ 0D61h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned EXIDE                  :1;
    };
    struct {
        unsigned RXF6EID16              :1;
        unsigned RXF6EID17              :1;
        unsigned                        :1;
        unsigned RXF6EXIDEN             :1;
        unsigned                        :1;
        unsigned RXF6SID0               :1;
        unsigned RXF6SID1               :1;
        unsigned RXF6SID2               :1;
    };
} RXF6SIDLbits_t;
extern volatile RXF6SIDLbits_t RXF6SIDLbits __at(0xD61);
// bitfield macros
#define _RXF6SIDL_EID16_POSN                                0x0
#define _RXF6SIDL_EID16_POSITION                            0x0
#define _RXF6SIDL_EID16_SIZE                                0x1
#define _RXF6SIDL_EID16_LENGTH                              0x1
#define _RXF6SIDL_EID16_MASK                                0x1
#define _RXF6SIDL_EID17_POSN                                0x1
#define _RXF6SIDL_EID17_POSITION                            0x1
#define _RXF6SIDL_EID17_SIZE                                0x1
#define _RXF6SIDL_EID17_LENGTH                              0x1
#define _RXF6SIDL_EID17_MASK                                0x2
#define _RXF6SIDL_EXIDEN_POSN                               0x3
#define _RXF6SIDL_EXIDEN_POSITION                           0x3
#define _RXF6SIDL_EXIDEN_SIZE                               0x1
#define _RXF6SIDL_EXIDEN_LENGTH                             0x1
#define _RXF6SIDL_EXIDEN_MASK                               0x8
#define _RXF6SIDL_SID0_POSN                                 0x5
#define _RXF6SIDL_SID0_POSITION                             0x5
#define _RXF6SIDL_SID0_SIZE                                 0x1
#define _RXF6SIDL_SID0_LENGTH                               0x1
#define _RXF6SIDL_SID0_MASK                                 0x20
#define _RXF6SIDL_SID1_POSN                                 0x6
#define _RXF6SIDL_SID1_POSITION                             0x6
#define _RXF6SIDL_SID1_SIZE                                 0x1
#define _RXF6SIDL_SID1_LENGTH                               0x1
#define _RXF6SIDL_SID1_MASK                                 0x40
#define _RXF6SIDL_SID2_POSN                                 0x7
#define _RXF6SIDL_SID2_POSITION                             0x7
#define _RXF6SIDL_SID2_SIZE                                 0x1
#define _RXF6SIDL_SID2_LENGTH                               0x1
#define _RXF6SIDL_SID2_MASK                                 0x80
#define _RXF6SIDL_EXIDE_POSN                                0x3
#define _RXF6SIDL_EXIDE_POSITION                            0x3
#define _RXF6SIDL_EXIDE_SIZE                                0x1
#define _RXF6SIDL_EXIDE_LENGTH                              0x1
#define _RXF6SIDL_EXIDE_MASK                                0x8
#define _RXF6SIDL_RXF6EID16_POSN                            0x0
#define _RXF6SIDL_RXF6EID16_POSITION                        0x0
#define _RXF6SIDL_RXF6EID16_SIZE                            0x1
#define _RXF6SIDL_RXF6EID16_LENGTH                          0x1
#define _RXF6SIDL_RXF6EID16_MASK                            0x1
#define _RXF6SIDL_RXF6EID17_POSN                            0x1
#define _RXF6SIDL_RXF6EID17_POSITION                        0x1
#define _RXF6SIDL_RXF6EID17_SIZE                            0x1
#define _RXF6SIDL_RXF6EID17_LENGTH                          0x1
#define _RXF6SIDL_RXF6EID17_MASK                            0x2
#define _RXF6SIDL_RXF6EXIDEN_POSN                           0x3
#define _RXF6SIDL_RXF6EXIDEN_POSITION                       0x3
#define _RXF6SIDL_RXF6EXIDEN_SIZE                           0x1
#define _RXF6SIDL_RXF6EXIDEN_LENGTH                         0x1
#define _RXF6SIDL_RXF6EXIDEN_MASK                           0x8
#define _RXF6SIDL_RXF6SID0_POSN                             0x5
#define _RXF6SIDL_RXF6SID0_POSITION                         0x5
#define _RXF6SIDL_RXF6SID0_SIZE                             0x1
#define _RXF6SIDL_RXF6SID0_LENGTH                           0x1
#define _RXF6SIDL_RXF6SID0_MASK                             0x20
#define _RXF6SIDL_RXF6SID1_POSN                             0x6
#define _RXF6SIDL_RXF6SID1_POSITION                         0x6
#define _RXF6SIDL_RXF6SID1_SIZE                             0x1
#define _RXF6SIDL_RXF6SID1_LENGTH                           0x1
#define _RXF6SIDL_RXF6SID1_MASK                             0x40
#define _RXF6SIDL_RXF6SID2_POSN                             0x7
#define _RXF6SIDL_RXF6SID2_POSITION                         0x7
#define _RXF6SIDL_RXF6SID2_SIZE                             0x1
#define _RXF6SIDL_RXF6SID2_LENGTH                           0x1
#define _RXF6SIDL_RXF6SID2_MASK                             0x80

// Register: RXF6EIDH
#define RXF6EIDH RXF6EIDH
extern volatile unsigned char           RXF6EIDH            __at(0xD62);
#ifndef _LIB_BUILD
asm("RXF6EIDH equ 0D62h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF6EID8               :1;
        unsigned RXF6EID9               :1;
        unsigned RXF6EID10              :1;
        unsigned RXF6EID11              :1;
        unsigned RXF6EID12              :1;
        unsigned RXF6EID13              :1;
        unsigned RXF6EID14              :1;
        unsigned RXF6EID15              :1;
    };
} RXF6EIDHbits_t;
