MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2685/mcu.h
// Register: RXF11SIDL
#define RXF11SIDL RXF11SIDL
extern volatile unsigned char           RXF11SIDL           __at(0xD79);
#ifndef _LIB_BUILD
asm("RXF11SIDL equ 0D79h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned EXIDE                  :1;
    };
    struct {
        unsigned RXF11EID16             :1;
        unsigned RXF11EID17             :1;
        unsigned                        :1;
        unsigned RXF11EXIDEN            :1;
        unsigned                        :1;
        unsigned RXF11SID0              :1;
        unsigned RXF11SID1              :1;
        unsigned RXF11SID2              :1;
    };
} RXF11SIDLbits_t;
extern volatile RXF11SIDLbits_t RXF11SIDLbits __at(0xD79);
// bitfield macros
#define _RXF11SIDL_EID16_POSN                               0x0
#define _RXF11SIDL_EID16_POSITION                           0x0
#define _RXF11SIDL_EID16_SIZE                               0x1
#define _RXF11SIDL_EID16_LENGTH                             0x1
#define _RXF11SIDL_EID16_MASK                               0x1
#define _RXF11SIDL_EID17_POSN                               0x1
#define _RXF11SIDL_EID17_POSITION                           0x1
#define _RXF11SIDL_EID17_SIZE                               0x1
#define _RXF11SIDL_EID17_LENGTH                             0x1
#define _RXF11SIDL_EID17_MASK                               0x2
#define _RXF11SIDL_EXIDEN_POSN                              0x3
#define _RXF11SIDL_EXIDEN_POSITION                          0x3
#define _RXF11SIDL_EXIDEN_SIZE                              0x1
#define _RXF11SIDL_EXIDEN_LENGTH                            0x1
#define _RXF11SIDL_EXIDEN_MASK                              0x8
#define _RXF11SIDL_SID0_POSN                                0x5
#define _RXF11SIDL_SID0_POSITION                            0x5
#define _RXF11SIDL_SID0_SIZE                                0x1
#define _RXF11SIDL_SID0_LENGTH                              0x1
#define _RXF11SIDL_SID0_MASK                                0x20
#define _RXF11SIDL_SID1_POSN                                0x6
#define _RXF11SIDL_SID1_POSITION                            0x6
#define _RXF11SIDL_SID1_SIZE                                0x1
#define _RXF11SIDL_SID1_LENGTH                              0x1
#define _RXF11SIDL_SID1_MASK                                0x40
#define _RXF11SIDL_SID2_POSN                                0x7
#define _RXF11SIDL_SID2_POSITION                            0x7
#define _RXF11SIDL_SID2_SIZE                                0x1
#define _RXF11SIDL_SID2_LENGTH                              0x1
#define _RXF11SIDL_SID2_MASK                                0x80
#define _RXF11SIDL_EXIDE_POSN                               0x3
#define _RXF11SIDL_EXIDE_POSITION                           0x3
#define _RXF11SIDL_EXIDE_SIZE                               0x1
#define _RXF11SIDL_EXIDE_LENGTH                             0x1
#define _RXF11SIDL_EXIDE_MASK                               0x8
#define _RXF11SIDL_RXF11EID16_POSN                          0x0
#define _RXF11SIDL_RXF11EID16_POSITION                      0x0
#define _RXF11SIDL_RXF11EID16_SIZE                          0x1
#define _RXF11SIDL_RXF11EID16_LENGTH                        0x1
#define _RXF11SIDL_RXF11EID16_MASK                          0x1
#define _RXF11SIDL_RXF11EID17_POSN                          0x1
#define _RXF11SIDL_RXF11EID17_POSITION                      0x1
#define _RXF11SIDL_RXF11EID17_SIZE                          0x1
#define _RXF11SIDL_RXF11EID17_LENGTH                        0x1
#define _RXF11SIDL_RXF11EID17_MASK                          0x2
#define _RXF11SIDL_RXF11EXIDEN_POSN                         0x3
#define _RXF11SIDL_RXF11EXIDEN_POSITION                     0x3
#define _RXF11SIDL_RXF11EXIDEN_SIZE                         0x1
#define _RXF11SIDL_RXF11EXIDEN_LENGTH                       0x1
#define _RXF11SIDL_RXF11EXIDEN_MASK                         0x8
#define _RXF11SIDL_RXF11SID0_POSN                           0x5
#define _RXF11SIDL_RXF11SID0_POSITION                       0x5
#define _RXF11SIDL_RXF11SID0_SIZE                           0x1
#define _RXF11SIDL_RXF11SID0_LENGTH                         0x1
#define _RXF11SIDL_RXF11SID0_MASK                           0x20
#define _RXF11SIDL_RXF11SID1_POSN                           0x6
#define _RXF11SIDL_RXF11SID1_POSITION                       0x6
#define _RXF11SIDL_RXF11SID1_SIZE                           0x1
#define _RXF11SIDL_RXF11SID1_LENGTH                         0x1
#define _RXF11SIDL_RXF11SID1_MASK                           0x40
#define _RXF11SIDL_RXF11SID2_POSN                           0x7
#define _RXF11SIDL_RXF11SID2_POSITION                       0x7
#define _RXF11SIDL_RXF11SID2_SIZE                           0x1
#define _RXF11SIDL_RXF11SID2_LENGTH                         0x1
#define _RXF11SIDL_RXF11SID2_MASK                           0x80

// Register: RXF11EIDH
#define RXF11EIDH RXF11EIDH
extern volatile unsigned char           RXF11EIDH           __at(0xD7A);
#ifndef _LIB_BUILD
asm("RXF11EIDH equ 0D7Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF11EID8              :1;
        unsigned RXF11EID9              :1;
        unsigned RXF11EID10             :1;
        unsigned RXF11EID11             :1;
        unsigned RXF11EID12             :1;
        unsigned RXF11EID13             :1;
        unsigned RXF11EID14             :1;
        unsigned RXF11EID15             :1;
    };
} RXF11EIDHbits_t;
extern volatile RXF11EIDHbits_t RXF11EIDHbits __at(0xD7A);
// bitfield macros
#define _RXF11EIDH_EID8_POSN                                0x0
#define _RXF11EIDH_EID8_POSITION                            0x0
#define _RXF11EIDH_EID8_SIZE                                0x1
#define _RXF11EIDH_EID8_LENGTH                              0x1
#define _RXF11EIDH_EID8_MASK                                0x1
#define _RXF11EIDH_EID9_POSN                                0x1
#define _RXF11EIDH_EID9_POSITION                            0x1
#define _RXF11EIDH_EID9_SIZE                                0x1
#define _RXF11EIDH_EID9_LENGTH                              0x1
#define _RXF11EIDH_EID9_MASK                                0x2
#define _RXF11EIDH_EID10_POSN                               0x2
#define _RXF11EIDH_EID10_POSITION                           0x2
#define _RXF11EIDH_EID10_SIZE                               0x1
#define _RXF11EIDH_EID10_LENGTH                             0x1
#define _RXF11EIDH_EID10_MASK                               0x4
#define _RXF11EIDH_EID11_POSN                               0x3
#define _RXF11EIDH_EID11_POSITION                           0x3
#define _RXF11EIDH_EID11_SIZE                               0x1
#define _RXF11EIDH_EID11_LENGTH                             0x1
#define _RXF11EIDH_EID11_MASK                               0x8
#define _RXF11EIDH_EID12_POSN                               0x4
#define _RXF11EIDH_EID12_POSITION                           0x4
#define _RXF11EIDH_EID12_SIZE                               0x1
#define _RXF11EIDH_EID12_LENGTH                             0x1
#define _RXF11EIDH_EID12_MASK                               0x10
#define _RXF11EIDH_EID13_POSN                               0x5
#define _RXF11EIDH_EID13_POSITION                           0x5
#define _RXF11EIDH_EID13_SIZE                               0x1
#define _RXF11EIDH_EID13_LENGTH                             0x1
#define _RXF11EIDH_EID13_MASK                               0x20
#define _RXF11EIDH_EID14_POSN                               0x6
#define _RXF11EIDH_EID14_POSITION                           0x6
#define _RXF11EIDH_EID14_SIZE                               0x1
#define _RXF11EIDH_EID14_LENGTH                             0x1
#define _RXF11EIDH_EID14_MASK                               0x40
#define _RXF11EIDH_EID15_POSN                               0x7
#define _RXF11EIDH_EID15_POSITION                           0x7
#define _RXF11EIDH_EID15_SIZE                               0x1
#define _RXF11EIDH_EID15_LENGTH                             0x1
#define _RXF11EIDH_EID15_MASK                               0x80
#define _RXF11EIDH_RXF11EID8_POSN                           0x0
#define _RXF11EIDH_RXF11EID8_POSITION                       0x0
#define _RXF11EIDH_RXF11EID8_SIZE                           0x1
#define _RXF11EIDH_RXF11EID8_LENGTH                         0x1
#define _RXF11EIDH_RXF11EID8_MASK                           0x1
#define _RXF11EIDH_RXF11EID9_POSN                           0x1
#define _RXF11EIDH_RXF11EID9_POSITION                       0x1
#define _RXF11EIDH_RXF11EID9_SIZE                           0x1
#define _RXF11EIDH_RXF11EID9_LENGTH                         0x1
#define _RXF11EIDH_RXF11EID9_MASK                           0x2
#define _RXF11EIDH_RXF11EID10_POSN                          0x2
#define _RXF11EIDH_RXF11EID10_POSITION                      0x2
#define _RXF11EIDH_RXF11EID10_SIZE                          0x1
#define _RXF11EIDH_RXF11EID10_LENGTH                        0x1
#define _RXF11EIDH_RXF11EID10_MASK                          0x4
#define _RXF11EIDH_RXF11EID11_POSN                          0x3
#define _RXF11EIDH_RXF11EID11_POSITION                      0x3
#define _RXF11EIDH_RXF11EID11_SIZE                          0x1
#define _RXF11EIDH_RXF11EID11_LENGTH                        0x1
#define _RXF11EIDH_RXF11EID11_MASK                          0x8
#define _RXF11EIDH_RXF11EID12_POSN                          0x4
#define _RXF11EIDH_RXF11EID12_POSITION                      0x4
#define _RXF11EIDH_RXF11EID12_SIZE                          0x1
#define _RXF11EIDH_RXF11EID12_LENGTH                        0x1
#define _RXF11EIDH_RXF11EID12_MASK                          0x10
#define _RXF11EIDH_RXF11EID13_POSN                          0x5
#define _RXF11EIDH_RXF11EID13_POSITION                      0x5
#define _RXF11EIDH_RXF11EID13_SIZE                          0x1
#define _RXF11EIDH_RXF11EID13_LENGTH                        0x1
#define _RXF11EIDH_RXF11EID13_MASK                          0x20
#define _RXF11EIDH_RXF11EID14_POSN                          0x6
#define _RXF11EIDH_RXF11EID14_POSITION                      0x6
#define _RXF11EIDH_RXF11EID14_SIZE                          0x1
#define _RXF11EIDH_RXF11EID14_LENGTH                        0x1
#define _RXF11EIDH_RXF11EID14_MASK                          0x40
#define _RXF11EIDH_RXF11EID15_POSN                          0x7
#define _RXF11EIDH_RXF11EID15_POSITION                      0x7
#define _RXF11EIDH_RXF11EID15_SIZE                          0x1
#define _RXF11EIDH_RXF11EID15_LENGTH                        0x1
#define _RXF11EIDH_RXF11EID15_MASK                          0x80

// Register: RXF11EIDL
#define RXF11EIDL RXF11EIDL
extern volatile unsigned char           RXF11EIDL           __at(0xD7B);
#ifndef _LIB_BUILD
asm("RXF11EIDL equ 0D7Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF11EID0              :1;
        unsigned RXF11EID1              :1;
        unsigned RXF11EID2              :1;
        unsigned RXF11EID3              :1;
        unsigned RXF11EID4              :1;
        unsigned RXF11EID5              :1;
        unsigned RXF11EID6              :1;
        unsigned RXF11EID7              :1;
    };
} RXF11EIDLbits_t;
extern volatile RXF11EIDLbits_t RXF11EIDLbits __at(0xD7B);
// bitfield macros
#define _RXF11EIDL_EID0_POSN                                0x0
#define _RXF11EIDL_EID0_POSITION                            0x0
#define _RXF11EIDL_EID0_SIZE                                0x1
#define _RXF11EIDL_EID0_LENGTH                              0x1
#define _RXF11EIDL_EID0_MASK                                0x1
#define _RXF11EIDL_EID1_POSN                                0x1
#define _RXF11EIDL_EID1_POSITION                            0x1
#define _RXF11EIDL_EID1_SIZE                                0x1
#define _RXF11EIDL_EID1_LENGTH                              0x1
#define _RXF11EIDL_EID1_MASK                                0x2
#define _RXF11EIDL_EID2_POSN                                0x2
#define _RXF11EIDL_EID2_POSITION                            0x2
#define _RXF11EIDL_EID2_SIZE                                0x1
#define _RXF11EIDL_EID2_LENGTH                              0x1
#define _RXF11EIDL_EID2_MASK                                0x4
#define _RXF11EIDL_EID3_POSN                                0x3
#define _RXF11EIDL_EID3_POSITION                            0x3
#define _RXF11EIDL_EID3_SIZE                                0x1
#define _RXF11EIDL_EID3_LENGTH                              0x1
#define _RXF11EIDL_EID3_MASK                                0x8
#define _RXF11EIDL_EID4_POSN                                0x4
#define _RXF11EIDL_EID4_POSITION                            0x4
#define _RXF11EIDL_EID4_SIZE                                0x1
#define _RXF11EIDL_EID4_LENGTH                              0x1
#define _RXF11EIDL_EID4_MASK                                0x10
#define _RXF11EIDL_EID5_POSN                                0x5
#define _RXF11EIDL_EID5_POSITION                            0x5
#define _RXF11EIDL_EID5_SIZE                                0x1
#define _RXF11EIDL_EID5_LENGTH                              0x1
#define _RXF11EIDL_EID5_MASK                                0x20
#define _RXF11EIDL_EID6_POSN                                0x6
#define _RXF11EIDL_EID6_POSITION                            0x6
#define _RXF11EIDL_EID6_SIZE                                0x1
#define _RXF11EIDL_EID6_LENGTH                              0x1
#define _RXF11EIDL_EID6_MASK                                0x40
#define _RXF11EIDL_EID7_POSN                                0x7
#define _RXF11EIDL_EID7_POSITION                            0x7
#define _RXF11EIDL_EID7_SIZE                                0x1
#define _RXF11EIDL_EID7_LENGTH                              0x1
#define _RXF11EIDL_EID7_MASK                                0x80
#define _RXF11EIDL_RXF11EID0_POSN                           0x0
#define _RXF11EIDL_RXF11EID0_POSITION                       0x0
#define _RXF11EIDL_RXF11EID0_SIZE                           0x1
#define _RXF11EIDL_RXF11EID0_LENGTH                         0x1
#define _RXF11EIDL_RXF11EID0_MASK                           0x1
#define _RXF11EIDL_RXF11EID1_POSN                           0x1
#define _RXF11EIDL_RXF11EID1_POSITION                       0x1
#define _RXF11EIDL_RXF11EID1_SIZE                           0x1
#define _RXF11EIDL_RXF11EID1_LENGTH                         0x1
#define _RXF11EIDL_RXF11EID1_MASK                           0x2
#define _RXF11EIDL_RXF11EID2_POSN                           0x2
#define _RXF11EIDL_RXF11EID2_POSITION                       0x2
#define _RXF11EIDL_RXF11EID2_SIZE                           0x1
#define _RXF11EIDL_RXF11EID2_LENGTH                         0x1
#define _RXF11EIDL_RXF11EID2_MASK                           0x4
#define _RXF11EIDL_RXF11EID3_POSN                           0x3
#define _RXF11EIDL_RXF11EID3_POSITION                       0x3
#define _RXF11EIDL_RXF11EID3_SIZE                           0x1
#define _RXF11EIDL_RXF11EID3_LENGTH                         0x1
#define _RXF11EIDL_RXF11EID3_MASK                           0x8
#define _RXF11EIDL_RXF11EID4_POSN                           0x4
#define _RXF11EIDL_RXF11EID4_POSITION                       0x4
#define _RXF11EIDL_RXF11EID4_SIZE                           0x1
#define _RXF11EIDL_RXF11EID4_LENGTH                         0x1
#define _RXF11EIDL_RXF11EID4_MASK                           0x10
#define _RXF11EIDL_RXF11EID5_POSN                           0x5
#define _RXF11EIDL_RXF11EID5_POSITION                       0x5
#define _RXF11EIDL_RXF11EID5_SIZE                           0x1
#define _RXF11EIDL_RXF11EID5_LENGTH                         0x1
#define _RXF11EIDL_RXF11EID5_MASK                           0x20
#define _RXF11EIDL_RXF11EID6_POSN                           0x6
#define _RXF11EIDL_RXF11EID6_POSITION                       0x6
#define _RXF11EIDL_RXF11EID6_SIZE                           0x1
#define _RXF11EIDL_RXF11EID6_LENGTH                         0x1
#define _RXF11EIDL_RXF11EID6_MASK                           0x40
#define _RXF11EIDL_RXF11EID7_POSN                           0x7
#define _RXF11EIDL_RXF11EID7_POSITION                       0x7
#define _RXF11EIDL_RXF11EID7_SIZE                           0x1
#define _RXF11EIDL_RXF11EID7_LENGTH                         0x1
#define _RXF11EIDL_RXF11EID7_MASK                           0x80

// Register: RXF12SIDH
#define RXF12SIDH RXF12SIDH
extern volatile unsigned char           RXF12SIDH           __at(0xD80);
#ifndef _LIB_BUILD
asm("RXF12SIDH equ 0D80h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF12SID3              :1;
        unsigned RXF12SID4              :1;
        unsigned RXF12SID5              :1;
        unsigned RXF12SID6              :1;
        unsigned RXF12SID7              :1;
        unsigned RXF12SID8              :1;
        unsigned RXF12SID9              :1;
        unsigned RXF12SID10             :1;
    };
} RXF12SIDHbits_t;
extern volatile RXF12SIDHbits_t RXF12SIDHbits __at(0xD80);
// bitfield macros
#define _RXF12SIDH_SID3_POSN                                0x0
#define _RXF12SIDH_SID3_POSITION                            0x0
#define _RXF12SIDH_SID3_SIZE                                0x1
#define _RXF12SIDH_SID3_LENGTH                              0x1
#define _RXF12SIDH_SID3_MASK                                0x1
#define _RXF12SIDH_SID4_POSN                                0x1
#define _RXF12SIDH_SID4_POSITION                            0x1
#define _RXF12SIDH_SID4_SIZE                                0x1
#define _RXF12SIDH_SID4_LENGTH                              0x1
#define _RXF12SIDH_SID4_MASK                                0x2
#define _RXF12SIDH_SID5_POSN                                0x2
#define _RXF12SIDH_SID5_POSITION                            0x2
#define _RXF12SIDH_SID5_SIZE                                0x1
#define _RXF12SIDH_SID5_LENGTH                              0x1
#define _RXF12SIDH_SID5_MASK                                0x4
#define _RXF12SIDH_SID6_POSN                                0x3
#define _RXF12SIDH_SID6_POSITION                            0x3
#define _RXF12SIDH_SID6_SIZE                                0x1
#define _RXF12SIDH_SID6_LENGTH                              0x1
#define _RXF12SIDH_SID6_MASK                                0x8
#define _RXF12SIDH_SID7_POSN                                0x4
#define _RXF12SIDH_SID7_POSITION                            0x4
#define _RXF12SIDH_SID7_SIZE                                0x1
#define _RXF12SIDH_SID7_LENGTH                              0x1
#define _RXF12SIDH_SID7_MASK                                0x10
#define _RXF12SIDH_SID8_POSN                                0x5
#define _RXF12SIDH_SID8_POSITION                            0x5
#define _RXF12SIDH_SID8_SIZE                                0x1
#define _RXF12SIDH_SID8_LENGTH                              0x1
#define _RXF12SIDH_SID8_MASK                                0x20
#define _RXF12SIDH_SID9_POSN                                0x6
#define _RXF12SIDH_SID9_POSITION                            0x6
#define _RXF12SIDH_SID9_SIZE                                0x1
#define _RXF12SIDH_SID9_LENGTH                              0x1
#define _RXF12SIDH_SID9_MASK                                0x40
#define _RXF12SIDH_SID10_POSN                               0x7
#define _RXF12SIDH_SID10_POSITION                           0x7
#define _RXF12SIDH_SID10_SIZE                               0x1
#define _RXF12SIDH_SID10_LENGTH                             0x1
#define _RXF12SIDH_SID10_MASK                               0x80
#define _RXF12SIDH_RXF12SID3_POSN                           0x0
#define _RXF12SIDH_RXF12SID3_POSITION                       0x0
#define _RXF12SIDH_RXF12SID3_SIZE                           0x1
#define _RXF12SIDH_RXF12SID3_LENGTH                         0x1
#define _RXF12SIDH_RXF12SID3_MASK                           0x1
#define _RXF12SIDH_RXF12SID4_POSN                           0x1
#define _RXF12SIDH_RXF12SID4_POSITION                       0x1
#define _RXF12SIDH_RXF12SID4_SIZE                           0x1
#define _RXF12SIDH_RXF12SID4_LENGTH                         0x1
#define _RXF12SIDH_RXF12SID4_MASK                           0x2
#define _RXF12SIDH_RXF12SID5_POSN                           0x2
#define _RXF12SIDH_RXF12SID5_POSITION                       0x2
#define _RXF12SIDH_RXF12SID5_SIZE                           0x1
#define _RXF12SIDH_RXF12SID5_LENGTH                         0x1
#define _RXF12SIDH_RXF12SID5_MASK                           0x4
#define _RXF12SIDH_RXF12SID6_POSN                           0x3
#define _RXF12SIDH_RXF12SID6_POSITION                       0x3
#define _RXF12SIDH_RXF12SID6_SIZE                           0x1
#define _RXF12SIDH_RXF12SID6_LENGTH                         0x1
#define _RXF12SIDH_RXF12SID6_MASK                           0x8
#define _RXF12SIDH_RXF12SID7_POSN                           0x4
#define _RXF12SIDH_RXF12SID7_POSITION                       0x4
#define _RXF12SIDH_RXF12SID7_SIZE                           0x1
#define _RXF12SIDH_RXF12SID7_LENGTH                         0x1
#define _RXF12SIDH_RXF12SID7_MASK                           0x10
#define _RXF12SIDH_RXF12SID8_POSN                           0x5
#define _RXF12SIDH_RXF12SID8_POSITION                       0x5
#define _RXF12SIDH_RXF12SID8_SIZE                           0x1
#define _RXF12SIDH_RXF12SID8_LENGTH                         0x1
#define _RXF12SIDH_RXF12SID8_MASK                           0x20
#define _RXF12SIDH_RXF12SID9_POSN                           0x6
#define _RXF12SIDH_RXF12SID9_POSITION                       0x6
#define _RXF12SIDH_RXF12SID9_SIZE                           0x1
#define _RXF12SIDH_RXF12SID9_LENGTH                         0x1
#define _RXF12SIDH_RXF12SID9_MASK                           0x40
#define _RXF12SIDH_RXF12SID10_POSN                          0x7
#define _RXF12SIDH_RXF12SID10_POSITION                      0x7
#define _RXF12SIDH_RXF12SID10_SIZE                          0x1
#define _RXF12SIDH_RXF12SID10_LENGTH                        0x1
#define _RXF12SIDH_RXF12SID10_MASK                          0x80

