MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2685/mcu.h
extern volatile MSEL2bits_t MSEL2bits __at(0xDF2);
// bitfield macros
#define _MSEL2_FIL8_0_POSN                                  0x0
#define _MSEL2_FIL8_0_POSITION                              0x0
#define _MSEL2_FIL8_0_SIZE                                  0x1
#define _MSEL2_FIL8_0_LENGTH                                0x1
#define _MSEL2_FIL8_0_MASK                                  0x1
#define _MSEL2_FIL8_1_POSN                                  0x1
#define _MSEL2_FIL8_1_POSITION                              0x1
#define _MSEL2_FIL8_1_SIZE                                  0x1
#define _MSEL2_FIL8_1_LENGTH                                0x1
#define _MSEL2_FIL8_1_MASK                                  0x2
#define _MSEL2_FIL9_0_POSN                                  0x2
#define _MSEL2_FIL9_0_POSITION                              0x2
#define _MSEL2_FIL9_0_SIZE                                  0x1
#define _MSEL2_FIL9_0_LENGTH                                0x1
#define _MSEL2_FIL9_0_MASK                                  0x4
#define _MSEL2_FIL9_1_POSN                                  0x3
#define _MSEL2_FIL9_1_POSITION                              0x3
#define _MSEL2_FIL9_1_SIZE                                  0x1
#define _MSEL2_FIL9_1_LENGTH                                0x1
#define _MSEL2_FIL9_1_MASK                                  0x8
#define _MSEL2_FIL10_0_POSN                                 0x4
#define _MSEL2_FIL10_0_POSITION                             0x4
#define _MSEL2_FIL10_0_SIZE                                 0x1
#define _MSEL2_FIL10_0_LENGTH                               0x1
#define _MSEL2_FIL10_0_MASK                                 0x10
#define _MSEL2_FIL10_1_POSN                                 0x5
#define _MSEL2_FIL10_1_POSITION                             0x5
#define _MSEL2_FIL10_1_SIZE                                 0x1
#define _MSEL2_FIL10_1_LENGTH                               0x1
#define _MSEL2_FIL10_1_MASK                                 0x20
#define _MSEL2_FIL11_0_POSN                                 0x6
#define _MSEL2_FIL11_0_POSITION                             0x6
#define _MSEL2_FIL11_0_SIZE                                 0x1
#define _MSEL2_FIL11_0_LENGTH                               0x1
#define _MSEL2_FIL11_0_MASK                                 0x40
#define _MSEL2_FIL11_1_POSN                                 0x7
#define _MSEL2_FIL11_1_POSITION                             0x7
#define _MSEL2_FIL11_1_SIZE                                 0x1
#define _MSEL2_FIL11_1_LENGTH                               0x1
#define _MSEL2_FIL11_1_MASK                                 0x80

// Register: MSEL3
#define MSEL3 MSEL3
extern volatile unsigned char           MSEL3               __at(0xDF3);
#ifndef _LIB_BUILD
asm("MSEL3 equ 0DF3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FIL12_0                :1;
        unsigned FIL12_1                :1;
        unsigned FIL13_0                :1;
        unsigned FIL13_1                :1;
        unsigned FIL14_0                :1;
        unsigned FIL14_1                :1;
        unsigned FIL15_0                :1;
        unsigned FIL15_1                :1;
    };
} MSEL3bits_t;
extern volatile MSEL3bits_t MSEL3bits __at(0xDF3);
// bitfield macros
#define _MSEL3_FIL12_0_POSN                                 0x0
#define _MSEL3_FIL12_0_POSITION                             0x0
#define _MSEL3_FIL12_0_SIZE                                 0x1
#define _MSEL3_FIL12_0_LENGTH                               0x1
#define _MSEL3_FIL12_0_MASK                                 0x1
#define _MSEL3_FIL12_1_POSN                                 0x1
#define _MSEL3_FIL12_1_POSITION                             0x1
#define _MSEL3_FIL12_1_SIZE                                 0x1
#define _MSEL3_FIL12_1_LENGTH                               0x1
#define _MSEL3_FIL12_1_MASK                                 0x2
#define _MSEL3_FIL13_0_POSN                                 0x2
#define _MSEL3_FIL13_0_POSITION                             0x2
#define _MSEL3_FIL13_0_SIZE                                 0x1
#define _MSEL3_FIL13_0_LENGTH                               0x1
#define _MSEL3_FIL13_0_MASK                                 0x4
#define _MSEL3_FIL13_1_POSN                                 0x3
#define _MSEL3_FIL13_1_POSITION                             0x3
#define _MSEL3_FIL13_1_SIZE                                 0x1
#define _MSEL3_FIL13_1_LENGTH                               0x1
#define _MSEL3_FIL13_1_MASK                                 0x8
#define _MSEL3_FIL14_0_POSN                                 0x4
#define _MSEL3_FIL14_0_POSITION                             0x4
#define _MSEL3_FIL14_0_SIZE                                 0x1
#define _MSEL3_FIL14_0_LENGTH                               0x1
#define _MSEL3_FIL14_0_MASK                                 0x10
#define _MSEL3_FIL14_1_POSN                                 0x5
#define _MSEL3_FIL14_1_POSITION                             0x5
#define _MSEL3_FIL14_1_SIZE                                 0x1
#define _MSEL3_FIL14_1_LENGTH                               0x1
#define _MSEL3_FIL14_1_MASK                                 0x20
#define _MSEL3_FIL15_0_POSN                                 0x6
#define _MSEL3_FIL15_0_POSITION                             0x6
#define _MSEL3_FIL15_0_SIZE                                 0x1
#define _MSEL3_FIL15_0_LENGTH                               0x1
#define _MSEL3_FIL15_0_MASK                                 0x40
#define _MSEL3_FIL15_1_POSN                                 0x7
#define _MSEL3_FIL15_1_POSITION                             0x7
#define _MSEL3_FIL15_1_SIZE                                 0x1
#define _MSEL3_FIL15_1_LENGTH                               0x1
#define _MSEL3_FIL15_1_MASK                                 0x80

// Register: BSEL0
#define BSEL0 BSEL0
extern volatile unsigned char           BSEL0               __at(0xDF8);
#ifndef _LIB_BUILD
asm("BSEL0 equ 0DF8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned B0TXEN                 :1;
        unsigned B1TXEN                 :1;
        unsigned B2TXEN                 :1;
        unsigned B3TXEN                 :1;
        unsigned B4TXEN                 :1;
        unsigned B5TXEN                 :1;
    };
} BSEL0bits_t;
extern volatile BSEL0bits_t BSEL0bits __at(0xDF8);
// bitfield macros
#define _BSEL0_B0TXEN_POSN                                  0x2
#define _BSEL0_B0TXEN_POSITION                              0x2
#define _BSEL0_B0TXEN_SIZE                                  0x1
#define _BSEL0_B0TXEN_LENGTH                                0x1
#define _BSEL0_B0TXEN_MASK                                  0x4
#define _BSEL0_B1TXEN_POSN                                  0x3
#define _BSEL0_B1TXEN_POSITION                              0x3
#define _BSEL0_B1TXEN_SIZE                                  0x1
#define _BSEL0_B1TXEN_LENGTH                                0x1
#define _BSEL0_B1TXEN_MASK                                  0x8
#define _BSEL0_B2TXEN_POSN                                  0x4
#define _BSEL0_B2TXEN_POSITION                              0x4
#define _BSEL0_B2TXEN_SIZE                                  0x1
#define _BSEL0_B2TXEN_LENGTH                                0x1
#define _BSEL0_B2TXEN_MASK                                  0x10
#define _BSEL0_B3TXEN_POSN                                  0x5
#define _BSEL0_B3TXEN_POSITION                              0x5
#define _BSEL0_B3TXEN_SIZE                                  0x1
#define _BSEL0_B3TXEN_LENGTH                                0x1
#define _BSEL0_B3TXEN_MASK                                  0x20
#define _BSEL0_B4TXEN_POSN                                  0x6
#define _BSEL0_B4TXEN_POSITION                              0x6
#define _BSEL0_B4TXEN_SIZE                                  0x1
#define _BSEL0_B4TXEN_LENGTH                                0x1
#define _BSEL0_B4TXEN_MASK                                  0x40
#define _BSEL0_B5TXEN_POSN                                  0x7
#define _BSEL0_B5TXEN_POSITION                              0x7
#define _BSEL0_B5TXEN_SIZE                                  0x1
#define _BSEL0_B5TXEN_LENGTH                                0x1
#define _BSEL0_B5TXEN_MASK                                  0x80

// Register: BIE0
#define BIE0 BIE0
extern volatile unsigned char           BIE0                __at(0xDFA);
#ifndef _LIB_BUILD
asm("BIE0 equ 0DFAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB0IE                 :1;
        unsigned RXB1IE                 :1;
        unsigned B0IE                   :1;
        unsigned B1IE                   :1;
        unsigned B2IE                   :1;
        unsigned B3IE                   :1;
        unsigned B4IE                   :1;
        unsigned B5IE                   :1;
    };
    struct {
        unsigned DRXB0IE                :1;
        unsigned DRXB1IE                :1;
    };
} BIE0bits_t;
extern volatile BIE0bits_t BIE0bits __at(0xDFA);
// bitfield macros
#define _BIE0_RXB0IE_POSN                                   0x0
#define _BIE0_RXB0IE_POSITION                               0x0
#define _BIE0_RXB0IE_SIZE                                   0x1
#define _BIE0_RXB0IE_LENGTH                                 0x1
#define _BIE0_RXB0IE_MASK                                   0x1
#define _BIE0_RXB1IE_POSN                                   0x1
#define _BIE0_RXB1IE_POSITION                               0x1
#define _BIE0_RXB1IE_SIZE                                   0x1
#define _BIE0_RXB1IE_LENGTH                                 0x1
#define _BIE0_RXB1IE_MASK                                   0x2
#define _BIE0_B0IE_POSN                                     0x2
#define _BIE0_B0IE_POSITION                                 0x2
#define _BIE0_B0IE_SIZE                                     0x1
#define _BIE0_B0IE_LENGTH                                   0x1
#define _BIE0_B0IE_MASK                                     0x4
#define _BIE0_B1IE_POSN                                     0x3
#define _BIE0_B1IE_POSITION                                 0x3
#define _BIE0_B1IE_SIZE                                     0x1
#define _BIE0_B1IE_LENGTH                                   0x1
#define _BIE0_B1IE_MASK                                     0x8
#define _BIE0_B2IE_POSN                                     0x4
#define _BIE0_B2IE_POSITION                                 0x4
#define _BIE0_B2IE_SIZE                                     0x1
#define _BIE0_B2IE_LENGTH                                   0x1
#define _BIE0_B2IE_MASK                                     0x10
#define _BIE0_B3IE_POSN                                     0x5
#define _BIE0_B3IE_POSITION                                 0x5
#define _BIE0_B3IE_SIZE                                     0x1
#define _BIE0_B3IE_LENGTH                                   0x1
#define _BIE0_B3IE_MASK                                     0x20
#define _BIE0_B4IE_POSN                                     0x6
#define _BIE0_B4IE_POSITION                                 0x6
#define _BIE0_B4IE_SIZE                                     0x1
#define _BIE0_B4IE_LENGTH                                   0x1
#define _BIE0_B4IE_MASK                                     0x40
#define _BIE0_B5IE_POSN                                     0x7
#define _BIE0_B5IE_POSITION                                 0x7
#define _BIE0_B5IE_SIZE                                     0x1
#define _BIE0_B5IE_LENGTH                                   0x1
#define _BIE0_B5IE_MASK                                     0x80
#define _BIE0_DRXB0IE_POSN                                  0x0
#define _BIE0_DRXB0IE_POSITION                              0x0
#define _BIE0_DRXB0IE_SIZE                                  0x1
#define _BIE0_DRXB0IE_LENGTH                                0x1
#define _BIE0_DRXB0IE_MASK                                  0x1
#define _BIE0_DRXB1IE_POSN                                  0x1
#define _BIE0_DRXB1IE_POSITION                              0x1
#define _BIE0_DRXB1IE_SIZE                                  0x1
#define _BIE0_DRXB1IE_LENGTH                                0x1
#define _BIE0_DRXB1IE_MASK                                  0x2

