MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2685/mcu.h
// Register: B5D2
#define B5D2 B5D2
extern volatile unsigned char           B5D2                __at(0xE78);
#ifndef _LIB_BUILD
asm("B5D2 equ 0E78h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B5D20                  :1;
        unsigned B5D21                  :1;
        unsigned B5D22                  :1;
        unsigned B5D23                  :1;
        unsigned B5D24                  :1;
        unsigned B5D25                  :1;
        unsigned B5D26                  :1;
        unsigned B5D27                  :1;
    };
    struct {
        unsigned                        :3;
        unsigned B57D23                 :1;
    };
} B5D2bits_t;
extern volatile B5D2bits_t B5D2bits __at(0xE78);
// bitfield macros
#define _B5D2_B5D20_POSN                                    0x0
#define _B5D2_B5D20_POSITION                                0x0
#define _B5D2_B5D20_SIZE                                    0x1
#define _B5D2_B5D20_LENGTH                                  0x1
#define _B5D2_B5D20_MASK                                    0x1
#define _B5D2_B5D21_POSN                                    0x1
#define _B5D2_B5D21_POSITION                                0x1
#define _B5D2_B5D21_SIZE                                    0x1
#define _B5D2_B5D21_LENGTH                                  0x1
#define _B5D2_B5D21_MASK                                    0x2
#define _B5D2_B5D22_POSN                                    0x2
#define _B5D2_B5D22_POSITION                                0x2
#define _B5D2_B5D22_SIZE                                    0x1
#define _B5D2_B5D22_LENGTH                                  0x1
#define _B5D2_B5D22_MASK                                    0x4
#define _B5D2_B5D23_POSN                                    0x3
#define _B5D2_B5D23_POSITION                                0x3
#define _B5D2_B5D23_SIZE                                    0x1
#define _B5D2_B5D23_LENGTH                                  0x1
#define _B5D2_B5D23_MASK                                    0x8
#define _B5D2_B5D24_POSN                                    0x4
#define _B5D2_B5D24_POSITION                                0x4
#define _B5D2_B5D24_SIZE                                    0x1
#define _B5D2_B5D24_LENGTH                                  0x1
#define _B5D2_B5D24_MASK                                    0x10
#define _B5D2_B5D25_POSN                                    0x5
#define _B5D2_B5D25_POSITION                                0x5
#define _B5D2_B5D25_SIZE                                    0x1
#define _B5D2_B5D25_LENGTH                                  0x1
#define _B5D2_B5D25_MASK                                    0x20
#define _B5D2_B5D26_POSN                                    0x6
#define _B5D2_B5D26_POSITION                                0x6
#define _B5D2_B5D26_SIZE                                    0x1
#define _B5D2_B5D26_LENGTH                                  0x1
#define _B5D2_B5D26_MASK                                    0x40
#define _B5D2_B5D27_POSN                                    0x7
#define _B5D2_B5D27_POSITION                                0x7
#define _B5D2_B5D27_SIZE                                    0x1
#define _B5D2_B5D27_LENGTH                                  0x1
#define _B5D2_B5D27_MASK                                    0x80
#define _B5D2_B57D23_POSN                                   0x3
#define _B5D2_B57D23_POSITION                               0x3
#define _B5D2_B57D23_SIZE                                   0x1
#define _B5D2_B57D23_LENGTH                                 0x1
#define _B5D2_B57D23_MASK                                   0x8

// Register: B5D3
#define B5D3 B5D3
extern volatile unsigned char           B5D3                __at(0xE79);
#ifndef _LIB_BUILD
asm("B5D3 equ 0E79h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B5D30                  :1;
        unsigned B5D31                  :1;
        unsigned B5D32                  :1;
        unsigned B5D33                  :1;
        unsigned B5D34                  :1;
        unsigned B5D35                  :1;
        unsigned B5D36                  :1;
        unsigned B5D37                  :1;
    };
} B5D3bits_t;
extern volatile B5D3bits_t B5D3bits __at(0xE79);
// bitfield macros
#define _B5D3_B5D30_POSN                                    0x0
#define _B5D3_B5D30_POSITION                                0x0
#define _B5D3_B5D30_SIZE                                    0x1
#define _B5D3_B5D30_LENGTH                                  0x1
#define _B5D3_B5D30_MASK                                    0x1
#define _B5D3_B5D31_POSN                                    0x1
#define _B5D3_B5D31_POSITION                                0x1
#define _B5D3_B5D31_SIZE                                    0x1
#define _B5D3_B5D31_LENGTH                                  0x1
#define _B5D3_B5D31_MASK                                    0x2
#define _B5D3_B5D32_POSN                                    0x2
#define _B5D3_B5D32_POSITION                                0x2
#define _B5D3_B5D32_SIZE                                    0x1
#define _B5D3_B5D32_LENGTH                                  0x1
#define _B5D3_B5D32_MASK                                    0x4
#define _B5D3_B5D33_POSN                                    0x3
#define _B5D3_B5D33_POSITION                                0x3
#define _B5D3_B5D33_SIZE                                    0x1
#define _B5D3_B5D33_LENGTH                                  0x1
#define _B5D3_B5D33_MASK                                    0x8
#define _B5D3_B5D34_POSN                                    0x4
#define _B5D3_B5D34_POSITION                                0x4
#define _B5D3_B5D34_SIZE                                    0x1
#define _B5D3_B5D34_LENGTH                                  0x1
#define _B5D3_B5D34_MASK                                    0x10
#define _B5D3_B5D35_POSN                                    0x5
#define _B5D3_B5D35_POSITION                                0x5
#define _B5D3_B5D35_SIZE                                    0x1
#define _B5D3_B5D35_LENGTH                                  0x1
#define _B5D3_B5D35_MASK                                    0x20
#define _B5D3_B5D36_POSN                                    0x6
#define _B5D3_B5D36_POSITION                                0x6
#define _B5D3_B5D36_SIZE                                    0x1
#define _B5D3_B5D36_LENGTH                                  0x1
#define _B5D3_B5D36_MASK                                    0x40
#define _B5D3_B5D37_POSN                                    0x7
#define _B5D3_B5D37_POSITION                                0x7
#define _B5D3_B5D37_SIZE                                    0x1
#define _B5D3_B5D37_LENGTH                                  0x1
#define _B5D3_B5D37_MASK                                    0x80

// Register: B5D4
#define B5D4 B5D4
extern volatile unsigned char           B5D4                __at(0xE7A);
#ifndef _LIB_BUILD
asm("B5D4 equ 0E7Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B5D40                  :1;
        unsigned B5D41                  :1;
        unsigned B5D42                  :1;
        unsigned B5D43                  :1;
        unsigned B5D44                  :1;
        unsigned B5D45                  :1;
        unsigned B5D46                  :1;
        unsigned B5D47                  :1;
    };
} B5D4bits_t;
extern volatile B5D4bits_t B5D4bits __at(0xE7A);
// bitfield macros
#define _B5D4_B5D40_POSN                                    0x0
#define _B5D4_B5D40_POSITION                                0x0
#define _B5D4_B5D40_SIZE                                    0x1
#define _B5D4_B5D40_LENGTH                                  0x1
#define _B5D4_B5D40_MASK                                    0x1
#define _B5D4_B5D41_POSN                                    0x1
#define _B5D4_B5D41_POSITION                                0x1
#define _B5D4_B5D41_SIZE                                    0x1
#define _B5D4_B5D41_LENGTH                                  0x1
#define _B5D4_B5D41_MASK                                    0x2
#define _B5D4_B5D42_POSN                                    0x2
#define _B5D4_B5D42_POSITION                                0x2
#define _B5D4_B5D42_SIZE                                    0x1
#define _B5D4_B5D42_LENGTH                                  0x1
#define _B5D4_B5D42_MASK                                    0x4
#define _B5D4_B5D43_POSN                                    0x3
#define _B5D4_B5D43_POSITION                                0x3
#define _B5D4_B5D43_SIZE                                    0x1
#define _B5D4_B5D43_LENGTH                                  0x1
#define _B5D4_B5D43_MASK                                    0x8
#define _B5D4_B5D44_POSN                                    0x4
#define _B5D4_B5D44_POSITION                                0x4
#define _B5D4_B5D44_SIZE                                    0x1
#define _B5D4_B5D44_LENGTH                                  0x1
#define _B5D4_B5D44_MASK                                    0x10
#define _B5D4_B5D45_POSN                                    0x5
#define _B5D4_B5D45_POSITION                                0x5
#define _B5D4_B5D45_SIZE                                    0x1
#define _B5D4_B5D45_LENGTH                                  0x1
#define _B5D4_B5D45_MASK                                    0x20
#define _B5D4_B5D46_POSN                                    0x6
#define _B5D4_B5D46_POSITION                                0x6
#define _B5D4_B5D46_SIZE                                    0x1
#define _B5D4_B5D46_LENGTH                                  0x1
#define _B5D4_B5D46_MASK                                    0x40
#define _B5D4_B5D47_POSN                                    0x7
#define _B5D4_B5D47_POSITION                                0x7
#define _B5D4_B5D47_SIZE                                    0x1
#define _B5D4_B5D47_LENGTH                                  0x1
#define _B5D4_B5D47_MASK                                    0x80

// Register: B5D5
#define B5D5 B5D5
extern volatile unsigned char           B5D5                __at(0xE7B);
#ifndef _LIB_BUILD
asm("B5D5 equ 0E7Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B5D50                  :1;
        unsigned B5D51                  :1;
        unsigned B5D52                  :1;
        unsigned B5D53                  :1;
        unsigned B5D54                  :1;
        unsigned B5D55                  :1;
        unsigned B5D56                  :1;
        unsigned B5D57                  :1;
    };
} B5D5bits_t;
extern volatile B5D5bits_t B5D5bits __at(0xE7B);
// bitfield macros
#define _B5D5_B5D50_POSN                                    0x0
#define _B5D5_B5D50_POSITION                                0x0
#define _B5D5_B5D50_SIZE                                    0x1
#define _B5D5_B5D50_LENGTH                                  0x1
#define _B5D5_B5D50_MASK                                    0x1
#define _B5D5_B5D51_POSN                                    0x1
#define _B5D5_B5D51_POSITION                                0x1
#define _B5D5_B5D51_SIZE                                    0x1
#define _B5D5_B5D51_LENGTH                                  0x1
#define _B5D5_B5D51_MASK                                    0x2
#define _B5D5_B5D52_POSN                                    0x2
#define _B5D5_B5D52_POSITION                                0x2
#define _B5D5_B5D52_SIZE                                    0x1
#define _B5D5_B5D52_LENGTH                                  0x1
#define _B5D5_B5D52_MASK                                    0x4
#define _B5D5_B5D53_POSN                                    0x3
#define _B5D5_B5D53_POSITION                                0x3
#define _B5D5_B5D53_SIZE                                    0x1
#define _B5D5_B5D53_LENGTH                                  0x1
#define _B5D5_B5D53_MASK                                    0x8
#define _B5D5_B5D54_POSN                                    0x4
#define _B5D5_B5D54_POSITION                                0x4
#define _B5D5_B5D54_SIZE                                    0x1
#define _B5D5_B5D54_LENGTH                                  0x1
#define _B5D5_B5D54_MASK                                    0x10
#define _B5D5_B5D55_POSN                                    0x5
#define _B5D5_B5D55_POSITION                                0x5
#define _B5D5_B5D55_SIZE                                    0x1
#define _B5D5_B5D55_LENGTH                                  0x1
#define _B5D5_B5D55_MASK                                    0x20
#define _B5D5_B5D56_POSN                                    0x6
#define _B5D5_B5D56_POSITION                                0x6
#define _B5D5_B5D56_SIZE                                    0x1
#define _B5D5_B5D56_LENGTH                                  0x1
#define _B5D5_B5D56_MASK                                    0x40
#define _B5D5_B5D57_POSN                                    0x7
#define _B5D5_B5D57_POSITION                                0x7
#define _B5D5_B5D57_SIZE                                    0x1
#define _B5D5_B5D57_LENGTH                                  0x1
#define _B5D5_B5D57_MASK                                    0x80

// Register: B5D6
#define B5D6 B5D6
extern volatile unsigned char           B5D6                __at(0xE7C);
#ifndef _LIB_BUILD
asm("B5D6 equ 0E7Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B5D60                  :1;
        unsigned B5D61                  :1;
        unsigned B5D62                  :1;
        unsigned B5D63                  :1;
        unsigned B5D64                  :1;
        unsigned B5D65                  :1;
        unsigned B5D66                  :1;
        unsigned B5D67                  :1;
    };
} B5D6bits_t;
extern volatile B5D6bits_t B5D6bits __at(0xE7C);
// bitfield macros
#define _B5D6_B5D60_POSN                                    0x0
#define _B5D6_B5D60_POSITION                                0x0
#define _B5D6_B5D60_SIZE                                    0x1
#define _B5D6_B5D60_LENGTH                                  0x1
#define _B5D6_B5D60_MASK                                    0x1
#define _B5D6_B5D61_POSN                                    0x1
#define _B5D6_B5D61_POSITION                                0x1
#define _B5D6_B5D61_SIZE                                    0x1
#define _B5D6_B5D61_LENGTH                                  0x1
#define _B5D6_B5D61_MASK                                    0x2
#define _B5D6_B5D62_POSN                                    0x2
#define _B5D6_B5D62_POSITION                                0x2
#define _B5D6_B5D62_SIZE                                    0x1
#define _B5D6_B5D62_LENGTH                                  0x1
#define _B5D6_B5D62_MASK                                    0x4
#define _B5D6_B5D63_POSN                                    0x3
#define _B5D6_B5D63_POSITION                                0x3
#define _B5D6_B5D63_SIZE                                    0x1
#define _B5D6_B5D63_LENGTH                                  0x1
#define _B5D6_B5D63_MASK                                    0x8
#define _B5D6_B5D64_POSN                                    0x4
#define _B5D6_B5D64_POSITION                                0x4
#define _B5D6_B5D64_SIZE                                    0x1
#define _B5D6_B5D64_LENGTH                                  0x1
#define _B5D6_B5D64_MASK                                    0x10
#define _B5D6_B5D65_POSN                                    0x5
#define _B5D6_B5D65_POSITION                                0x5
#define _B5D6_B5D65_SIZE                                    0x1
#define _B5D6_B5D65_LENGTH                                  0x1
#define _B5D6_B5D65_MASK                                    0x20
#define _B5D6_B5D66_POSN                                    0x6
#define _B5D6_B5D66_POSITION                                0x6
#define _B5D6_B5D66_SIZE                                    0x1
#define _B5D6_B5D66_LENGTH                                  0x1
#define _B5D6_B5D66_MASK                                    0x40
#define _B5D6_B5D67_POSN                                    0x7
#define _B5D6_B5D67_POSITION                                0x7
#define _B5D6_B5D67_SIZE                                    0x1
#define _B5D6_B5D67_LENGTH                                  0x1
#define _B5D6_B5D67_MASK                                    0x80

// Register: B5D7
#define B5D7 B5D7
extern volatile unsigned char           B5D7                __at(0xE7D);
#ifndef _LIB_BUILD
asm("B5D7 equ 0E7Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B5D70                  :1;
        unsigned B5D71                  :1;
        unsigned B5D72                  :1;
        unsigned B5D73                  :1;
        unsigned B5D74                  :1;
        unsigned B5D75                  :1;
        unsigned B5D76                  :1;
        unsigned B5D77                  :1;
    };
} B5D7bits_t;
extern volatile B5D7bits_t B5D7bits __at(0xE7D);
// bitfield macros
#define _B5D7_B5D70_POSN                                    0x0
#define _B5D7_B5D70_POSITION                                0x0
#define _B5D7_B5D70_SIZE                                    0x1
#define _B5D7_B5D70_LENGTH                                  0x1
#define _B5D7_B5D70_MASK                                    0x1
#define _B5D7_B5D71_POSN                                    0x1
#define _B5D7_B5D71_POSITION                                0x1
#define _B5D7_B5D71_SIZE                                    0x1
#define _B5D7_B5D71_LENGTH                                  0x1
#define _B5D7_B5D71_MASK                                    0x2
#define _B5D7_B5D72_POSN                                    0x2
#define _B5D7_B5D72_POSITION                                0x2
#define _B5D7_B5D72_SIZE                                    0x1
#define _B5D7_B5D72_LENGTH                                  0x1
#define _B5D7_B5D72_MASK                                    0x4
#define _B5D7_B5D73_POSN                                    0x3
#define _B5D7_B5D73_POSITION                                0x3
#define _B5D7_B5D73_SIZE                                    0x1
#define _B5D7_B5D73_LENGTH                                  0x1
#define _B5D7_B5D73_MASK                                    0x8
#define _B5D7_B5D74_POSN                                    0x4
#define _B5D7_B5D74_POSITION                                0x4
#define _B5D7_B5D74_SIZE                                    0x1
#define _B5D7_B5D74_LENGTH                                  0x1
#define _B5D7_B5D74_MASK                                    0x10
#define _B5D7_B5D75_POSN                                    0x5
#define _B5D7_B5D75_POSITION                                0x5
#define _B5D7_B5D75_SIZE                                    0x1
#define _B5D7_B5D75_LENGTH                                  0x1
#define _B5D7_B5D75_MASK                                    0x20
#define _B5D7_B5D76_POSN                                    0x6
#define _B5D7_B5D76_POSITION                                0x6
#define _B5D7_B5D76_SIZE                                    0x1
#define _B5D7_B5D76_LENGTH                                  0x1
#define _B5D7_B5D76_MASK                                    0x40
#define _B5D7_B5D77_POSN                                    0x7
#define _B5D7_B5D77_POSITION                                0x7
#define _B5D7_B5D77_SIZE                                    0x1
#define _B5D7_B5D77_LENGTH                                  0x1
#define _B5D7_B5D77_MASK                                    0x80

// Register: CANSTAT_RO4
#define CANSTAT_RO4 CANSTAT_RO4
extern volatile unsigned char           CANSTAT_RO4         __at(0xE7E);
#ifndef _LIB_BUILD
asm("CANSTAT_RO4 equ 0E7Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EICODE0                :1;
        unsigned EICODE1_ICODE0         :1;
        unsigned EICODE2_ICODE1         :1;
        unsigned EICODE3_ICODE2         :1;
        unsigned EICODE4                :1;
        unsigned OPMODE0                :1;
        unsigned OPMODE1                :1;
        unsigned OPMODE2                :1;
    };
    struct {
        unsigned ICODE0                 :1;
        unsigned ICODE1                 :1;
        unsigned ICODE2                 :1;
        unsigned ICODE3                 :1;
        unsigned ICODE4                 :1;
    };
} CANSTAT_RO4bits_t;
