MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2685/mcu.h
// Register: RXB1D1
#define RXB1D1 RXB1D1
extern volatile unsigned char           RXB1D1              __at(0xF57);
#ifndef _LIB_BUILD
asm("RXB1D1 equ 0F57h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB1D10                :1;
        unsigned RXB1D11                :1;
        unsigned RXB1D12                :1;
        unsigned RXB1D13                :1;
        unsigned RXB1D14                :1;
        unsigned RXB1D15                :1;
        unsigned RXB1D16                :1;
        unsigned RXB1D17                :1;
    };
} RXB1D1bits_t;
extern volatile RXB1D1bits_t RXB1D1bits __at(0xF57);
// bitfield macros
#define _RXB1D1_RXB1D10_POSN                                0x0
#define _RXB1D1_RXB1D10_POSITION                            0x0
#define _RXB1D1_RXB1D10_SIZE                                0x1
#define _RXB1D1_RXB1D10_LENGTH                              0x1
#define _RXB1D1_RXB1D10_MASK                                0x1
#define _RXB1D1_RXB1D11_POSN                                0x1
#define _RXB1D1_RXB1D11_POSITION                            0x1
#define _RXB1D1_RXB1D11_SIZE                                0x1
#define _RXB1D1_RXB1D11_LENGTH                              0x1
#define _RXB1D1_RXB1D11_MASK                                0x2
#define _RXB1D1_RXB1D12_POSN                                0x2
#define _RXB1D1_RXB1D12_POSITION                            0x2
#define _RXB1D1_RXB1D12_SIZE                                0x1
#define _RXB1D1_RXB1D12_LENGTH                              0x1
#define _RXB1D1_RXB1D12_MASK                                0x4
#define _RXB1D1_RXB1D13_POSN                                0x3
#define _RXB1D1_RXB1D13_POSITION                            0x3
#define _RXB1D1_RXB1D13_SIZE                                0x1
#define _RXB1D1_RXB1D13_LENGTH                              0x1
#define _RXB1D1_RXB1D13_MASK                                0x8
#define _RXB1D1_RXB1D14_POSN                                0x4
#define _RXB1D1_RXB1D14_POSITION                            0x4
#define _RXB1D1_RXB1D14_SIZE                                0x1
#define _RXB1D1_RXB1D14_LENGTH                              0x1
#define _RXB1D1_RXB1D14_MASK                                0x10
#define _RXB1D1_RXB1D15_POSN                                0x5
#define _RXB1D1_RXB1D15_POSITION                            0x5
#define _RXB1D1_RXB1D15_SIZE                                0x1
#define _RXB1D1_RXB1D15_LENGTH                              0x1
#define _RXB1D1_RXB1D15_MASK                                0x20
#define _RXB1D1_RXB1D16_POSN                                0x6
#define _RXB1D1_RXB1D16_POSITION                            0x6
#define _RXB1D1_RXB1D16_SIZE                                0x1
#define _RXB1D1_RXB1D16_LENGTH                              0x1
#define _RXB1D1_RXB1D16_MASK                                0x40
#define _RXB1D1_RXB1D17_POSN                                0x7
#define _RXB1D1_RXB1D17_POSITION                            0x7
#define _RXB1D1_RXB1D17_SIZE                                0x1
#define _RXB1D1_RXB1D17_LENGTH                              0x1
#define _RXB1D1_RXB1D17_MASK                                0x80

// Register: RXB1D2
#define RXB1D2 RXB1D2
extern volatile unsigned char           RXB1D2              __at(0xF58);
#ifndef _LIB_BUILD
asm("RXB1D2 equ 0F58h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB1D20                :1;
        unsigned RXB1D21                :1;
        unsigned RXB1D22                :1;
        unsigned RXB1D23                :1;
        unsigned RXB1D24                :1;
        unsigned RXB1D25                :1;
        unsigned RXB1D26                :1;
        unsigned RXB1D27                :1;
    };
} RXB1D2bits_t;
extern volatile RXB1D2bits_t RXB1D2bits __at(0xF58);
// bitfield macros
#define _RXB1D2_RXB1D20_POSN                                0x0
#define _RXB1D2_RXB1D20_POSITION                            0x0
#define _RXB1D2_RXB1D20_SIZE                                0x1
#define _RXB1D2_RXB1D20_LENGTH                              0x1
#define _RXB1D2_RXB1D20_MASK                                0x1
#define _RXB1D2_RXB1D21_POSN                                0x1
#define _RXB1D2_RXB1D21_POSITION                            0x1
#define _RXB1D2_RXB1D21_SIZE                                0x1
#define _RXB1D2_RXB1D21_LENGTH                              0x1
#define _RXB1D2_RXB1D21_MASK                                0x2
#define _RXB1D2_RXB1D22_POSN                                0x2
#define _RXB1D2_RXB1D22_POSITION                            0x2
#define _RXB1D2_RXB1D22_SIZE                                0x1
#define _RXB1D2_RXB1D22_LENGTH                              0x1
#define _RXB1D2_RXB1D22_MASK                                0x4
#define _RXB1D2_RXB1D23_POSN                                0x3
#define _RXB1D2_RXB1D23_POSITION                            0x3
#define _RXB1D2_RXB1D23_SIZE                                0x1
#define _RXB1D2_RXB1D23_LENGTH                              0x1
#define _RXB1D2_RXB1D23_MASK                                0x8
#define _RXB1D2_RXB1D24_POSN                                0x4
#define _RXB1D2_RXB1D24_POSITION                            0x4
#define _RXB1D2_RXB1D24_SIZE                                0x1
#define _RXB1D2_RXB1D24_LENGTH                              0x1
#define _RXB1D2_RXB1D24_MASK                                0x10
#define _RXB1D2_RXB1D25_POSN                                0x5
#define _RXB1D2_RXB1D25_POSITION                            0x5
#define _RXB1D2_RXB1D25_SIZE                                0x1
#define _RXB1D2_RXB1D25_LENGTH                              0x1
#define _RXB1D2_RXB1D25_MASK                                0x20
#define _RXB1D2_RXB1D26_POSN                                0x6
#define _RXB1D2_RXB1D26_POSITION                            0x6
#define _RXB1D2_RXB1D26_SIZE                                0x1
#define _RXB1D2_RXB1D26_LENGTH                              0x1
#define _RXB1D2_RXB1D26_MASK                                0x40
#define _RXB1D2_RXB1D27_POSN                                0x7
#define _RXB1D2_RXB1D27_POSITION                            0x7
#define _RXB1D2_RXB1D27_SIZE                                0x1
#define _RXB1D2_RXB1D27_LENGTH                              0x1
#define _RXB1D2_RXB1D27_MASK                                0x80

