MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2685/mcu.h
#define                                 B3SID5_bit          _BIT_ACCESS(B3SIDH,2)
// B3SIDH<B3SID6>
extern volatile __bit                   B3SID6              __at(0x728B);	// @ (0xE51 * 8 + 3)
#define                                 B3SID6_bit          _BIT_ACCESS(B3SIDH,3)
// B3SIDH<B3SID7>
extern volatile __bit                   B3SID7              __at(0x728C);	// @ (0xE51 * 8 + 4)
#define                                 B3SID7_bit          _BIT_ACCESS(B3SIDH,4)
// B3SIDH<B3SID8>
extern volatile __bit                   B3SID8              __at(0x728D);	// @ (0xE51 * 8 + 5)
#define                                 B3SID8_bit          _BIT_ACCESS(B3SIDH,5)
// B3SIDH<B3SID9>
extern volatile __bit                   B3SID9              __at(0x728E);	// @ (0xE51 * 8 + 6)
#define                                 B3SID9_bit          _BIT_ACCESS(B3SIDH,6)
// B3SIDL<B3SRR>
extern volatile __bit                   B3SRR               __at(0x7294);	// @ (0xE52 * 8 + 4)
#define                                 B3SRR_bit           _BIT_ACCESS(B3SIDL,4)
// B3CON<B3TXABT>
extern volatile __bit                   B3TXABT             __at(0x7286);	// @ (0xE50 * 8 + 6)
#define                                 B3TXABT_bit         _BIT_ACCESS(B3CON,6)
// B3CON<B3TXB3IF>
extern volatile __bit                   B3TXB3IF            __at(0x7287);	// @ (0xE50 * 8 + 7)
#define                                 B3TXB3IF_bit        _BIT_ACCESS(B3CON,7)
// BSEL0<B3TXEN>
extern volatile __bit                   B3TXEN              __at(0x6FC5);	// @ (0xDF8 * 8 + 5)
#define                                 B3TXEN_bit          _BIT_ACCESS(BSEL0,5)
// B3CON<B3TXERR>
extern volatile __bit                   B3TXERR             __at(0x7284);	// @ (0xE50 * 8 + 4)
#define                                 B3TXERR_bit         _BIT_ACCESS(B3CON,4)
// B3CON<B3TXLARB>
extern volatile __bit                   B3TXLARB            __at(0x7285);	// @ (0xE50 * 8 + 5)
#define                                 B3TXLARB_bit        _BIT_ACCESS(B3CON,5)
// B3CON<B3TXPRI0>
extern volatile __bit                   B3TXPRI0            __at(0x7280);	// @ (0xE50 * 8 + 0)
#define                                 B3TXPRI0_bit        _BIT_ACCESS(B3CON,0)
// B3CON<B3TXPRI1>
extern volatile __bit                   B3TXPRI1            __at(0x7281);	// @ (0xE50 * 8 + 1)
#define                                 B3TXPRI1_bit        _BIT_ACCESS(B3CON,1)
// B3CON<B3TXREQ>
extern volatile __bit                   B3TXREQ             __at(0x7283);	// @ (0xE50 * 8 + 3)
#define                                 B3TXREQ_bit         _BIT_ACCESS(B3CON,3)
// B4D7<B46D77>
extern volatile __bit                   B46D77              __at(0x736F);	// @ (0xE6D * 8 + 7)
#define                                 B46D77_bit          _BIT_ACCESS(B4D7,7)
// B4D0<B4D00>
extern volatile __bit                   B4D00               __at(0x7330);	// @ (0xE66 * 8 + 0)
#define                                 B4D00_bit           _BIT_ACCESS(B4D0,0)
// B4D0<B4D01>
extern volatile __bit                   B4D01               __at(0x7331);	// @ (0xE66 * 8 + 1)
#define                                 B4D01_bit           _BIT_ACCESS(B4D0,1)
// B4D0<B4D02>
extern volatile __bit                   B4D02               __at(0x7332);	// @ (0xE66 * 8 + 2)
#define                                 B4D02_bit           _BIT_ACCESS(B4D0,2)
// B4D0<B4D03>
extern volatile __bit                   B4D03               __at(0x7333);	// @ (0xE66 * 8 + 3)
#define                                 B4D03_bit           _BIT_ACCESS(B4D0,3)
// B4D0<B4D04>
extern volatile __bit                   B4D04               __at(0x7334);	// @ (0xE66 * 8 + 4)
#define                                 B4D04_bit           _BIT_ACCESS(B4D0,4)
// B4D0<B4D05>
extern volatile __bit                   B4D05               __at(0x7335);	// @ (0xE66 * 8 + 5)
#define                                 B4D05_bit           _BIT_ACCESS(B4D0,5)
// B4D0<B4D06>
extern volatile __bit                   B4D06               __at(0x7336);	// @ (0xE66 * 8 + 6)
#define                                 B4D06_bit           _BIT_ACCESS(B4D0,6)
// B4D0<B4D07>
extern volatile __bit                   B4D07               __at(0x7337);	// @ (0xE66 * 8 + 7)
#define                                 B4D07_bit           _BIT_ACCESS(B4D0,7)
// B4D1<B4D10>
extern volatile __bit                   B4D10               __at(0x7338);	// @ (0xE67 * 8 + 0)
#define                                 B4D10_bit           _BIT_ACCESS(B4D1,0)
// B4D1<B4D11>
extern volatile __bit                   B4D11               __at(0x7339);	// @ (0xE67 * 8 + 1)
#define                                 B4D11_bit           _BIT_ACCESS(B4D1,1)
// B4D1<B4D12>
extern volatile __bit                   B4D12               __at(0x733A);	// @ (0xE67 * 8 + 2)
#define                                 B4D12_bit           _BIT_ACCESS(B4D1,2)
// B4D1<B4D13>
extern volatile __bit                   B4D13               __at(0x733B);	// @ (0xE67 * 8 + 3)
#define                                 B4D13_bit           _BIT_ACCESS(B4D1,3)
// B4D1<B4D14>
extern volatile __bit                   B4D14               __at(0x733C);	// @ (0xE67 * 8 + 4)
#define                                 B4D14_bit           _BIT_ACCESS(B4D1,4)
// B4D1<B4D15>
extern volatile __bit                   B4D15               __at(0x733D);	// @ (0xE67 * 8 + 5)
#define                                 B4D15_bit           _BIT_ACCESS(B4D1,5)
// B4D1<B4D16>
extern volatile __bit                   B4D16               __at(0x733E);	// @ (0xE67 * 8 + 6)
#define                                 B4D16_bit           _BIT_ACCESS(B4D1,6)
// B4D1<B4D17>
extern volatile __bit                   B4D17               __at(0x733F);	// @ (0xE67 * 8 + 7)
#define                                 B4D17_bit           _BIT_ACCESS(B4D1,7)
// B4D2<B4D20>
extern volatile __bit                   B4D20               __at(0x7340);	// @ (0xE68 * 8 + 0)
#define                                 B4D20_bit           _BIT_ACCESS(B4D2,0)
// B4D2<B4D21>
extern volatile __bit                   B4D21               __at(0x7341);	// @ (0xE68 * 8 + 1)
#define                                 B4D21_bit           _BIT_ACCESS(B4D2,1)
// B4D2<B4D22>
extern volatile __bit                   B4D22               __at(0x7342);	// @ (0xE68 * 8 + 2)
#define                                 B4D22_bit           _BIT_ACCESS(B4D2,2)
// B4D2<B4D23>
extern volatile __bit                   B4D23               __at(0x7343);	// @ (0xE68 * 8 + 3)
#define                                 B4D23_bit           _BIT_ACCESS(B4D2,3)
// B4D2<B4D24>
extern volatile __bit                   B4D24               __at(0x7344);	// @ (0xE68 * 8 + 4)
#define                                 B4D24_bit           _BIT_ACCESS(B4D2,4)
// B4D2<B4D25>
extern volatile __bit                   B4D25               __at(0x7345);	// @ (0xE68 * 8 + 5)
#define                                 B4D25_bit           _BIT_ACCESS(B4D2,5)
// B4D2<B4D26>
extern volatile __bit                   B4D26               __at(0x7346);	// @ (0xE68 * 8 + 6)
#define                                 B4D26_bit           _BIT_ACCESS(B4D2,6)
// B4D2<B4D27>
extern volatile __bit                   B4D27               __at(0x7347);	// @ (0xE68 * 8 + 7)
#define                                 B4D27_bit           _BIT_ACCESS(B4D2,7)
// B4D3<B4D30>
extern volatile __bit                   B4D30               __at(0x7348);	// @ (0xE69 * 8 + 0)
#define                                 B4D30_bit           _BIT_ACCESS(B4D3,0)
// B4D3<B4D31>
extern volatile __bit                   B4D31               __at(0x7349);	// @ (0xE69 * 8 + 1)
#define                                 B4D31_bit           _BIT_ACCESS(B4D3,1)
// B4D3<B4D32>
extern volatile __bit                   B4D32               __at(0x734A);	// @ (0xE69 * 8 + 2)
#define                                 B4D32_bit           _BIT_ACCESS(B4D3,2)
// B4D3<B4D33>
extern volatile __bit                   B4D33               __at(0x734B);	// @ (0xE69 * 8 + 3)
#define                                 B4D33_bit           _BIT_ACCESS(B4D3,3)
// B4D3<B4D34>
extern volatile __bit                   B4D34               __at(0x734C);	// @ (0xE69 * 8 + 4)
#define                                 B4D34_bit           _BIT_ACCESS(B4D3,4)
// B4D3<B4D35>
extern volatile __bit                   B4D35               __at(0x734D);	// @ (0xE69 * 8 + 5)
#define                                 B4D35_bit           _BIT_ACCESS(B4D3,5)
// B4D3<B4D36>
extern volatile __bit                   B4D36               __at(0x734E);	// @ (0xE69 * 8 + 6)
#define                                 B4D36_bit           _BIT_ACCESS(B4D3,6)
// B4D3<B4D37>
extern volatile __bit                   B4D37               __at(0x734F);	// @ (0xE69 * 8 + 7)
#define                                 B4D37_bit           _BIT_ACCESS(B4D3,7)
// B4D4<B4D40>
extern volatile __bit                   B4D40               __at(0x7350);	// @ (0xE6A * 8 + 0)
#define                                 B4D40_bit           _BIT_ACCESS(B4D4,0)
// B4D4<B4D41>
extern volatile __bit                   B4D41               __at(0x7351);	// @ (0xE6A * 8 + 1)
#define                                 B4D41_bit           _BIT_ACCESS(B4D4,1)
// B4D4<B4D42>
extern volatile __bit                   B4D42               __at(0x7352);	// @ (0xE6A * 8 + 2)
#define                                 B4D42_bit           _BIT_ACCESS(B4D4,2)
// B4D4<B4D43>
extern volatile __bit                   B4D43               __at(0x7353);	// @ (0xE6A * 8 + 3)
#define                                 B4D43_bit           _BIT_ACCESS(B4D4,3)
// B4D4<B4D44>
extern volatile __bit                   B4D44               __at(0x7354);	// @ (0xE6A * 8 + 4)
#define                                 B4D44_bit           _BIT_ACCESS(B4D4,4)
// B4D4<B4D45>
extern volatile __bit                   B4D45               __at(0x7355);	// @ (0xE6A * 8 + 5)
#define                                 B4D45_bit           _BIT_ACCESS(B4D4,5)
// B4D4<B4D46>
extern volatile __bit                   B4D46               __at(0x7356);	// @ (0xE6A * 8 + 6)
#define                                 B4D46_bit           _BIT_ACCESS(B4D4,6)
// B4D4<B4D47>
extern volatile __bit                   B4D47               __at(0x7357);	// @ (0xE6A * 8 + 7)
#define                                 B4D47_bit           _BIT_ACCESS(B4D4,7)
// B4D5<B4D50>
extern volatile __bit                   B4D50               __at(0x7358);	// @ (0xE6B * 8 + 0)
#define                                 B4D50_bit           _BIT_ACCESS(B4D5,0)
// B4D5<B4D51>
extern volatile __bit                   B4D51               __at(0x7359);	// @ (0xE6B * 8 + 1)
#define                                 B4D51_bit           _BIT_ACCESS(B4D5,1)
// B4D5<B4D52>
extern volatile __bit                   B4D52               __at(0x735A);	// @ (0xE6B * 8 + 2)
#define                                 B4D52_bit           _BIT_ACCESS(B4D5,2)
// B4D5<B4D53>
extern volatile __bit                   B4D53               __at(0x735B);	// @ (0xE6B * 8 + 3)
#define                                 B4D53_bit           _BIT_ACCESS(B4D5,3)
// B4D5<B4D54>
extern volatile __bit                   B4D54               __at(0x735C);	// @ (0xE6B * 8 + 4)
#define                                 B4D54_bit           _BIT_ACCESS(B4D5,4)
// B4D5<B4D55>
extern volatile __bit                   B4D55               __at(0x735D);	// @ (0xE6B * 8 + 5)
#define                                 B4D55_bit           _BIT_ACCESS(B4D5,5)
// B4D5<B4D56>
extern volatile __bit                   B4D56               __at(0x735E);	// @ (0xE6B * 8 + 6)
#define                                 B4D56_bit           _BIT_ACCESS(B4D5,6)
// B4D5<B4D57>
extern volatile __bit                   B4D57               __at(0x735F);	// @ (0xE6B * 8 + 7)
#define                                 B4D57_bit           _BIT_ACCESS(B4D5,7)
// B4D6<B4D60>
extern volatile __bit                   B4D60               __at(0x7360);	// @ (0xE6C * 8 + 0)
#define                                 B4D60_bit           _BIT_ACCESS(B4D6,0)
// B4D6<B4D61>
extern volatile __bit                   B4D61               __at(0x7361);	// @ (0xE6C * 8 + 1)
#define                                 B4D61_bit           _BIT_ACCESS(B4D6,1)
// B4D6<B4D62>
extern volatile __bit                   B4D62               __at(0x7362);	// @ (0xE6C * 8 + 2)
#define                                 B4D62_bit           _BIT_ACCESS(B4D6,2)
// B4D6<B4D63>
extern volatile __bit                   B4D63               __at(0x7363);	// @ (0xE6C * 8 + 3)
#define                                 B4D63_bit           _BIT_ACCESS(B4D6,3)
// B4D6<B4D64>
extern volatile __bit                   B4D64               __at(0x7364);	// @ (0xE6C * 8 + 4)
#define                                 B4D64_bit           _BIT_ACCESS(B4D6,4)
// B4D6<B4D65>
extern volatile __bit                   B4D65               __at(0x7365);	// @ (0xE6C * 8 + 5)
#define                                 B4D65_bit           _BIT_ACCESS(B4D6,5)
// B4D6<B4D66>
extern volatile __bit                   B4D66               __at(0x7366);	// @ (0xE6C * 8 + 6)
#define                                 B4D66_bit           _BIT_ACCESS(B4D6,6)
// B4D6<B4D67>
extern volatile __bit                   B4D67               __at(0x7367);	// @ (0xE6C * 8 + 7)
#define                                 B4D67_bit           _BIT_ACCESS(B4D6,7)
// B4D7<B4D70>
extern volatile __bit                   B4D70               __at(0x7368);	// @ (0xE6D * 8 + 0)
#define                                 B4D70_bit           _BIT_ACCESS(B4D7,0)
// B4D7<B4D71>
extern volatile __bit                   B4D71               __at(0x7369);	// @ (0xE6D * 8 + 1)
#define                                 B4D71_bit           _BIT_ACCESS(B4D7,1)
// B4D7<B4D72>
extern volatile __bit                   B4D72               __at(0x736A);	// @ (0xE6D * 8 + 2)
#define                                 B4D72_bit           _BIT_ACCESS(B4D7,2)
// B4D7<B4D73>
extern volatile __bit                   B4D73               __at(0x736B);	// @ (0xE6D * 8 + 3)
#define                                 B4D73_bit           _BIT_ACCESS(B4D7,3)
// B4D7<B4D74>
extern volatile __bit                   B4D74               __at(0x736C);	// @ (0xE6D * 8 + 4)
#define                                 B4D74_bit           _BIT_ACCESS(B4D7,4)
// B4D7<B4D75>
extern volatile __bit                   B4D75               __at(0x736D);	// @ (0xE6D * 8 + 5)
#define                                 B4D75_bit           _BIT_ACCESS(B4D7,5)
// B4D7<B4D76>
extern volatile __bit                   B4D76               __at(0x736E);	// @ (0xE6D * 8 + 6)
#define                                 B4D76_bit           _BIT_ACCESS(B4D7,6)
// B4D7<B4D77>
extern volatile __bit                   B4D77               __at(0x736F);	// @ (0xE6D * 8 + 7)
#define                                 B4D77_bit           _BIT_ACCESS(B4D7,7)
// B4DLC<B4DLC0>
extern volatile __bit                   B4DLC0              __at(0x7328);	// @ (0xE65 * 8 + 0)
#define                                 B4DLC0_bit          _BIT_ACCESS(B4DLC,0)
// B4DLC<B4DLC1>
extern volatile __bit                   B4DLC1              __at(0x7329);	// @ (0xE65 * 8 + 1)
#define                                 B4DLC1_bit          _BIT_ACCESS(B4DLC,1)
// B4DLC<B4DLC2>
extern volatile __bit                   B4DLC2              __at(0x732A);	// @ (0xE65 * 8 + 2)
#define                                 B4DLC2_bit          _BIT_ACCESS(B4DLC,2)
// B4DLC<B4DLC3>
extern volatile __bit                   B4DLC3              __at(0x732B);	// @ (0xE65 * 8 + 3)
#define                                 B4DLC3_bit          _BIT_ACCESS(B4DLC,3)
// B4EIDL<B4EID0>
extern volatile __bit                   B4EID0              __at(0x7320);	// @ (0xE64 * 8 + 0)
#define                                 B4EID0_bit          _BIT_ACCESS(B4EIDL,0)
// B4EIDL<B4EID1>
extern volatile __bit                   B4EID1              __at(0x7321);	// @ (0xE64 * 8 + 1)
#define                                 B4EID1_bit          _BIT_ACCESS(B4EIDL,1)
// B4EIDH<B4EID10>
extern volatile __bit                   B4EID10             __at(0x731A);	// @ (0xE63 * 8 + 2)
#define                                 B4EID10_bit         _BIT_ACCESS(B4EIDH,2)
// B4EIDH<B4EID11>
extern volatile __bit                   B4EID11             __at(0x731B);	// @ (0xE63 * 8 + 3)
#define                                 B4EID11_bit         _BIT_ACCESS(B4EIDH,3)
// B4EIDH<B4EID12>
extern volatile __bit                   B4EID12             __at(0x731C);	// @ (0xE63 * 8 + 4)
#define                                 B4EID12_bit         _BIT_ACCESS(B4EIDH,4)
// B4EIDH<B4EID13>
extern volatile __bit                   B4EID13             __at(0x731D);	// @ (0xE63 * 8 + 5)
#define                                 B4EID13_bit         _BIT_ACCESS(B4EIDH,5)
// B4EIDH<B4EID14>
extern volatile __bit                   B4EID14             __at(0x731E);	// @ (0xE63 * 8 + 6)
#define                                 B4EID14_bit         _BIT_ACCESS(B4EIDH,6)
// B4EIDH<B4EID15>
extern volatile __bit                   B4EID15             __at(0x731F);	// @ (0xE63 * 8 + 7)
#define                                 B4EID15_bit         _BIT_ACCESS(B4EIDH,7)
// B4SIDL<B4EID16>
extern volatile __bit                   B4EID16             __at(0x7310);	// @ (0xE62 * 8 + 0)
#define                                 B4EID16_bit         _BIT_ACCESS(B4SIDL,0)
// B4SIDL<B4EID17>
extern volatile __bit                   B4EID17             __at(0x7311);	// @ (0xE62 * 8 + 1)
#define                                 B4EID17_bit         _BIT_ACCESS(B4SIDL,1)
// B4EIDL<B4EID2>
extern volatile __bit                   B4EID2              __at(0x7322);	// @ (0xE64 * 8 + 2)
#define                                 B4EID2_bit          _BIT_ACCESS(B4EIDL,2)
// B4EIDL<B4EID3>
extern volatile __bit                   B4EID3              __at(0x7323);	// @ (0xE64 * 8 + 3)
#define                                 B4EID3_bit          _BIT_ACCESS(B4EIDL,3)
// B4EIDL<B4EID4>
extern volatile __bit                   B4EID4              __at(0x7324);	// @ (0xE64 * 8 + 4)
#define                                 B4EID4_bit          _BIT_ACCESS(B4EIDL,4)
// B4EIDL<B4EID5>
extern volatile __bit                   B4EID5              __at(0x7325);	// @ (0xE64 * 8 + 5)
#define                                 B4EID5_bit          _BIT_ACCESS(B4EIDL,5)
// B4EIDL<B4EID6>
extern volatile __bit                   B4EID6              __at(0x7326);	// @ (0xE64 * 8 + 6)
#define                                 B4EID6_bit          _BIT_ACCESS(B4EIDL,6)
// B4EIDL<B4EID7>
extern volatile __bit                   B4EID7              __at(0x7327);	// @ (0xE64 * 8 + 7)
#define                                 B4EID7_bit          _BIT_ACCESS(B4EIDL,7)
// B4EIDH<B4EID8>
extern volatile __bit                   B4EID8              __at(0x7318);	// @ (0xE63 * 8 + 0)
#define                                 B4EID8_bit          _BIT_ACCESS(B4EIDH,0)
// B4EIDH<B4EID9>
extern volatile __bit                   B4EID9              __at(0x7319);	// @ (0xE63 * 8 + 1)
#define                                 B4EID9_bit          _BIT_ACCESS(B4EIDH,1)
// B4SIDL<B4EXID>
extern volatile __bit                   B4EXID              __at(0x7313);	// @ (0xE62 * 8 + 3)
#define                                 B4EXID_bit          _BIT_ACCESS(B4SIDL,3)
// B4SIDL<B4EXIDE>
extern volatile __bit                   B4EXIDE             __at(0x7313);	// @ (0xE62 * 8 + 3)
#define                                 B4EXIDE_bit         _BIT_ACCESS(B4SIDL,3)
// B4CON<B4FILHIT0>
extern volatile __bit                   B4FILHIT0           __at(0x7300);	// @ (0xE60 * 8 + 0)
#define                                 B4FILHIT0_bit       _BIT_ACCESS(B4CON,0)
// B4CON<B4FILHIT1>
extern volatile __bit                   B4FILHIT1           __at(0x7301);	// @ (0xE60 * 8 + 1)
#define                                 B4FILHIT1_bit       _BIT_ACCESS(B4CON,1)
// B4CON<B4FILHIT2>
extern volatile __bit                   B4FILHIT2           __at(0x7302);	// @ (0xE60 * 8 + 2)
#define                                 B4FILHIT2_bit       _BIT_ACCESS(B4CON,2)
// B4CON<B4FILHIT3>
extern volatile __bit                   B4FILHIT3           __at(0x7303);	// @ (0xE60 * 8 + 3)
#define                                 B4FILHIT3_bit       _BIT_ACCESS(B4CON,3)
// B4CON<B4FILHIT4>
extern volatile __bit                   B4FILHIT4           __at(0x7304);	// @ (0xE60 * 8 + 4)
#define                                 B4FILHIT4_bit       _BIT_ACCESS(B4CON,4)
// BIE0<B4IE>
extern volatile __bit                   B4IE                __at(0x6FD6);	// @ (0xDFA * 8 + 6)
#define                                 B4IE_bit            _BIT_ACCESS(BIE0,6)
// B4DLC<B4RB0>
extern volatile __bit                   B4RB0               __at(0x732C);	// @ (0xE65 * 8 + 4)
#define                                 B4RB0_bit           _BIT_ACCESS(B4DLC,4)
// B4DLC<B4RB1>
extern volatile __bit                   B4RB1               __at(0x732D);	// @ (0xE65 * 8 + 5)
#define                                 B4RB1_bit           _BIT_ACCESS(B4DLC,5)
// B4CON<B4RTREN>
extern volatile __bit                   B4RTREN             __at(0x7302);	// @ (0xE60 * 8 + 2)
#define                                 B4RTREN_bit         _BIT_ACCESS(B4CON,2)
// B4CON<B4RTRRO>
extern volatile __bit                   B4RTRRO             __at(0x7305);	// @ (0xE60 * 8 + 5)
#define                                 B4RTRRO_bit         _BIT_ACCESS(B4CON,5)
// B4CON<B4RXFUL>
extern volatile __bit                   B4RXFUL             __at(0x7307);	// @ (0xE60 * 8 + 7)
#define                                 B4RXFUL_bit         _BIT_ACCESS(B4CON,7)
// B4CON<B4RXM1>
extern volatile __bit                   B4RXM1              __at(0x7306);	// @ (0xE60 * 8 + 6)
#define                                 B4RXM1_bit          _BIT_ACCESS(B4CON,6)
// B4DLC<B4RXRTR>
extern volatile __bit                   B4RXRTR             __at(0x732E);	// @ (0xE65 * 8 + 6)
#define                                 B4RXRTR_bit         _BIT_ACCESS(B4DLC,6)
// B4SIDL<B4SID0>
extern volatile __bit                   B4SID0              __at(0x7315);	// @ (0xE62 * 8 + 5)
#define                                 B4SID0_bit          _BIT_ACCESS(B4SIDL,5)
// B4SIDL<B4SID1>
extern volatile __bit                   B4SID1              __at(0x7316);	// @ (0xE62 * 8 + 6)
#define                                 B4SID1_bit          _BIT_ACCESS(B4SIDL,6)
// B4SIDH<B4SID10>
extern volatile __bit                   B4SID10             __at(0x730F);	// @ (0xE61 * 8 + 7)
#define                                 B4SID10_bit         _BIT_ACCESS(B4SIDH,7)
// B4SIDL<B4SID2>
extern volatile __bit                   B4SID2              __at(0x7317);	// @ (0xE62 * 8 + 7)
#define                                 B4SID2_bit          _BIT_ACCESS(B4SIDL,7)
// B4SIDH<B4SID3>
extern volatile __bit                   B4SID3              __at(0x7308);	// @ (0xE61 * 8 + 0)
#define                                 B4SID3_bit          _BIT_ACCESS(B4SIDH,0)
// B4SIDH<B4SID4>
extern volatile __bit                   B4SID4              __at(0x7309);	// @ (0xE61 * 8 + 1)
#define                                 B4SID4_bit          _BIT_ACCESS(B4SIDH,1)
// B4SIDH<B4SID5>
extern volatile __bit                   B4SID5              __at(0x730A);	// @ (0xE61 * 8 + 2)
#define                                 B4SID5_bit          _BIT_ACCESS(B4SIDH,2)
// B4SIDH<B4SID6>
extern volatile __bit                   B4SID6              __at(0x730B);	// @ (0xE61 * 8 + 3)
#define                                 B4SID6_bit          _BIT_ACCESS(B4SIDH,3)
// B4SIDH<B4SID7>
extern volatile __bit                   B4SID7              __at(0x730C);	// @ (0xE61 * 8 + 4)
#define                                 B4SID7_bit          _BIT_ACCESS(B4SIDH,4)
// B4SIDH<B4SID8>
